// ให้เขียนโค้ดเพื่อหาผลรวมของจำนวนเต็มตั้งแต่ 1 ถึง 100 ตามเงื่อนไขดังนี้

// - หาผลรวมตัวเลขทุกตัว
// - หาผลรวมเฉพาะเลขคู่ และผลรวมเฉพาะเลขคี่
// - หาผลรวมของเลขที่หาร 2 ลงตัว ยกกำลังสอง (2^2 + 4^2 + ...) ลบด้วยผลรวมของเลขที่หาร 3 ลงตัว ยกกำลัง 2 (3^2 + 6^2 + ...)




let sum = 0;

// หาผลรวมตัวเลขทุกตัว
for (let i = 1; i <= 100; i++) {
    sum = (sum + i);
}  
console.log(sum) // 5050

//หาผลรวมเฉพาะเลขคู่
even = 0;
for (let i = 1; i <= 100; i++) {
    if(i % 2 === 0){
        even+=i; 
    }   
}
console.log(even) // 2550

//หาผลรวมเฉพาะเลขคี่
odd = 0;
for (let i = 1; i <= 100; i++) {
    if(i % 2 === 1){
        odd+=i; 
    }   
}
console.log(odd) //2500

// - หาผลรวมของเลขที่หาร 2 ลงตัว ยกกำลังสอง (2^2 + 4^2 + ...) ลบด้วยผลรวมของเลขที่หาร 3 ลงตัว ยกกำลัง 2 (3^2 + 6^2 + ...)

evenExpo = 0;
oddExpo = 0;

for (let i = 1; i <= 100; i++) {
    if(i % 2 === 0){
        evenExpo+=(i**2);  
    } if (i % 3 === 0){
        oddExpo+=(i**2);  
    }      
}
console.log(`${evenExpo} - ${oddExpo} = ${evenExpo-oddExpo}`)