// For ใช้ในกรณีรู้จำนวนรอบที่ชัดเจน
// While ใช้ในกรณีที่ไม่รู้จำนวนรอบ
// Do ใช้ในกรณีที่อยากให้ลองทำก่อน 1 รอบ แล้วทำซ้ำไปเรื่อยๆ ตราบเท่าที่เงื่อนไขเป็นจริง

////////////////////////////////////////////////////////////////
//Break หลุดจากการทำงานในลูปทันที เพื่อไปทำคำสั่งที่อยู่นอกลูป
for (let num = 1; num <= 10; num++) {
  if (num == 5) break;
  console.log("num ", num);
}
console.log(
  "(num == 5) break หลุดจากการทำงานในลูปทันที เพื่อไปทำคำสั่งที่อยู่นอกลูป"
);

//Continues หยุดการทำงานแล้วย้อนกลับไปเริ่มทำใหม่ ไม่หลุดลูป
for (let num = 1; num <= 10; num++) {
  if (num == 5) continue;
  console.log("num", num);
}
console.log(
  "(num == 5) continue; หยุดการทำงานแล้วย้อนกลับไปเริ่มทำใหม่ ไม่หลุดลูป"
);

////////////////////////////////////////////////////////////////
let count = 1;

while (count <= 5) {
  console.log("Loop =", count);
  // ถ้า count = 2 out loop
  if (count == 2) {
    break;
  }
  count++; //นับจำนวนรอบ
}

////////////////////////////////////////////////////////////////
let x = 1;

do {
  console.log("doo", x);
  x++;
} while (x < 6);
{
  console.log("Loop", x);
}
